src/Catalogs/Вложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапомнитьЗаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДанныеВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеВложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Вложения/Ext/ObjectModule.bsl
// Документ (вложение): файл, связанный с вещью или домом (ADR-002). Двоичные
// данные лежат в регистре ДанныеВложений, объект хранит только метаданные файла.

#Область ОбработчикиСобытий

// При пометке на удаление убираем файл из основного фото вещи и стираем данные
// файла — в одной транзакции с пометкой. У объекта справочника нет события
// «при установке пометки удаления», поэтому пометка ловится при записи.
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ПометкаУдаления Или ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.ПометкаУдаления Тогда
		Возврат; // пометка уже стояла
	КонецЕсли;

	ОчиститьОсновноеФотоВещи();
	СтеретьДанныеФайла();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Если файл — основное фото вещи, очищаем фото у вещи.
Процедура ОчиститьОсновноеФотоВещи()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Вещи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Вещи КАК Вещи
	|ГДЕ
	|	Вещи.ОсновноеФото = &Вложение";
	Запрос.УстановитьПараметр("Вложение", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	Вещь = Выборка.Ссылка.ПолучитьОбъект();
	Если Вещь = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Вещь.ОсновноеФото = Справочники.Вложения.ПустаяСсылка();
	Вещь.Записать();

КонецПроцедуры

// Стирает данные файла из регистра ДанныеВложений.
Процедура СтеретьДанныеФайла()

	Набор = РегистрыСведений.ДанныеВложений.СоздатьНаборЗаписей();
	Набор.Отбор.Вложение.Установить(Ссылка);
	Набор.Записать(Истина);

КонецПроцедуры

#КонецОбласти
